app/Controllers/AdminController.php

    public function index()
    {
        // 1. Cek Session Login
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        // --- A. LOGIKA STATISTIK ---
        $totalClients = $db->table('users')->where('role', 'user')->countAllResults();

        try {
            $totalServices = $db->table('services')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'
SELECT COUNT(*) AS `numrows`
FROM `services`