app/Controllers/BookingController.php

INSERT INTO `bookings` (`user_id`, `stylist`, `time`, `total_price`, `created_at`, `updated_at`) VALUES (1, 'Pinnki', '12.00', 25000, '2025-12-02 01:38:52', '2025-12-02 01:38:52')
---
        ];

        // Insert dan dapatkan ID baru
        $bookingModel->insert($bookingData);