app/Controllers/LayoutAdmin.php

    private function getPendingCount()
    {
        return $this->bookingModel->groupStart()
            ->where('status', 'pending')
            ->orWhere('status', null)
            ->groupEnd()
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE   (
`status` = 'pending'
OR `status` IS NULL
 )

    private function getCurrentAdmin()
    {
        $idAdmin = session()->get('id') ?? 1;
        return $this->adminModel->where('id', $idAdmin)->first();
---
SELECT *
FROM `admins`
WHERE `id` = 1
 LIMIT 1

    public function dashboard_admin()
    {
        // 1. STATISTIK
        $totalClients = $this->db->table('users')->where('role', 'user')->countAllResults();
        try {
            $totalServices = $this->db->table('services')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'
SELECT COUNT(*) AS `numrows`
FROM `services`