app/Controllers/ServiceController.php

    public function edit($id)
    {
        $service = $this->serviceModel->find($id);
---
SELECT *
FROM `services`
WHERE `services`.`id` = '12'