app/Controllers/ServiceController.php

SELECT *
FROM `services`
ORDER BY `id` DESC
---
    public function index()
    {
        $data = [
            'page_title'  => 'Services',
            'activeMenu'  => 'service',
            // Ambil data service
            'services'    => $this->serviceModel->orderBy('id', 'DESC')->findAll()

SELECT *
FROM `services`
WHERE `services`.`id` = '12'
---
    public function edit($id)
    {
        $data = [
            'page_title' => 'Edit Service',
            'activeMenu' => 'service',
            'service'    => $this->serviceModel->find($id)