app/Models/BookingModel.php

    public function isBooked($time, $stylist)
    {
        return $this->where('time', $time)
                    ->where('stylist', $stylist)
                    ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `time` = '09.00'
AND `stylist` = 'Tisna'